app/views/projetos/resultado.html.erb

SELECT "prioridade_relativas".* FROM "prioridade_relativas" WHERE "prioridade_relativas"."projeto_id" = ? AND "prioridade_relativas"."criterio_id" = ?  [["projeto_id", 1], ["criterio_id", 1]]
---
        <caption><h4><%= c.nome%></h4></caption>
        <% @prioridades_relativas = @projeto.prioridade_relativas.where(:criterio_id => c.id) %>