app/views/projetos/resultado.html.erb

SELECT "criterios".* FROM "criterios" WHERE "criterios"."projeto_id" = ?  [["projeto_id", 4]]
---
<h3>Prioridade dos criterios</h3>
<% @criterios = Criterio.all%>

SELECT "prioridade_relativas".* FROM "prioridade_relativas" WHERE "prioridade_relativas"."projeto_id" = ?  [["projeto_id", 4]]
---
<h3>Prioridade Relativa</h3>
<% @projeto.prioridade_relativas.each do |p| %>

SELECT "alternativas".* FROM "alternativas" WHERE "alternativas"."projeto_id" = ?  [["projeto_id", 4]]
---
<h3>Prioridade Global</h3>
<% @alternativas = Alternativa.all%>