app/views/projetos/show.html.erb


<% @projeto.alternativas.each do |alternativa| %>
---
SELECT "alternativas".* FROM "alternativas" WHERE "alternativas"."projeto_id" = ?  [["projeto_id", 1]]

<br/><br/>
<% @projeto.criterios.each do |criterio| %>
---
SELECT "criterios".* FROM "criterios" WHERE "criterios"."projeto_id" = ?  [["projeto_id", 1]]

<br/><br/>
<% @projeto.grupo_avaliacaos.each do |grupo_avaliacao| %>
---
SELECT "grupo_avaliacaos".* FROM "grupo_avaliacaos" WHERE "grupo_avaliacaos"."projeto_id" = ?  [["projeto_id", 1]]