app/views/criterios/_form.html.erb

SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <%= f.submit "Salvar", :class => "btn btn-primary" %>
    <%= link_to "Cancelar", Projeto.find(params[:projeto_id]), :class => "btn btn-danger"%>