app/views/criterios/show.html.erb

SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<%= link_to 'Editar', edit_criterio_path(@criterio), :class => "btn btn-warning" %>
<%= link_to 'Voltar', Projeto.find(@criterio.projeto_id), :class => "btn btn-primary" %>