app/controllers/alternativas_controller.rb

  def index
    @alternativas = Alternativa.all
---
SELECT "alternativas".* FROM "alternativas"

  def create
    @alternativa = Alternativa.new(alternativa_params)

    respond_to do |format|
      if @alternativa.save
---
INSERT INTO "alternativas" ("nome", "codigo", "created_at", "updated_at", "projeto_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "alt-1"], ["codigo", ""], ["created_at", "2017-05-22 00:57:17.258431"], ["updated_at", "2017-05-22 00:57:17.258431"], ["projeto_id", 1]]

  def update
    respond_to do |format|
      if @alternativa.update(alternativa_params)
---
UPDATE "alternativas" SET "nome" = ?, "codigo" = ?, "projeto_id" = ?, "updated_at" = ? WHERE "alternativas"."id" = ?  [["nome", "alt-2"], ["codigo", "alt-2"], ["projeto_id", nil], ["updated_at", 2016-11-22 18:11:27 UTC], ["id", 2]]

  def destroy
    @projeto = Projeto.find(@alternativa.projeto_id)
    @julgamentos = Julgamento.where(:alternativa_id => @alternativa.id)
    @alternativa.destroy
---
SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "alternativas" WHERE "alternativas"."id" = ?  [["id", 3]]

    def set_alternativa
      @alternativa = Alternativa.find(params[:id])
---
SELECT  "alternativas".* FROM "alternativas" WHERE "alternativas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]