app/controllers/criterios_controller.rb

SELECT "criterios".* FROM "criterios"
---
  def index
    @criterios = Criterio.all

INSERT INTO "criterios" ("nome", "codigo", "created_at", "updated_at", "projeto_id", "criterio_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "sub criterio 1"], ["codigo", ""], ["created_at", "2018-06-11 13:53:22.218762"], ["updated_at", "2018-06-11 13:53:22.218762"], ["projeto_id", 1], ["criterio_id", 1]]
---
  def create
    @criterio = Criterio.new(criterio_params)

    respond_to do |format|
      if @criterio.save

UPDATE "criterios" SET "nome" = ?, "codigo" = ?, "projeto_id" = ?, "updated_at" = ? WHERE "criterios"."id" = ?  [["nome", "cri2"], ["codigo", "cri2"], ["projeto_id", nil], ["updated_at", 2016-11-22 18:12:15 UTC], ["id", 4]]
---
  def update
    respond_to do |format|
      if @criterio.update(criterio_params)

SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "criterios" WHERE "criterios"."id" = ?  [["id", 1]]
---
  def destroy
    @projeto = Projeto.find(@criterio.projeto_id)
    @criterio.destroy

SELECT  "criterios".* FROM "criterios" WHERE "criterios"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_criterio
      @criterio = Criterio.find(params[:id])