app/controllers/grupo_avaliacaos_controller.rb

SELECT "grupo_avaliacaos".* FROM "grupo_avaliacaos"
---
  def index
    @grupo_avaliacaos = GrupoAvaliacao.all

INSERT INTO "grupo_avaliacaos" ("nome", "peso", "projeto_id", "ativo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "grupo 1"], ["peso", 1.0], ["projeto_id", 1], ["ativo", true], ["created_at", 2016-11-21 18:11:35 UTC], ["updated_at", 2016-11-21 18:11:35 UTC]]
---
  def create
    @grupo_avaliacao = GrupoAvaliacao.new(grupo_avaliacao_params)

    respond_to do |format|
      if @grupo_avaliacao.save

SELECT  "grupo_avaliacaos".* FROM "grupo_avaliacaos" WHERE "grupo_avaliacaos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_grupo_avaliacao
      @grupo_avaliacao = GrupoAvaliacao.find(params[:id])