app/controllers/julgamento_criterios_controller.rb

SELECT "julgamento_criterios".* FROM "julgamento_criterios"
---
  def index
    @julgamento_criterios = JulgamentoCriterio.all

SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "criterios".* FROM "criterios" WHERE "criterios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "julgamento_criterios".* FROM "julgamento_criterios" WHERE "julgamento_criterios"."projeto_id" = ? AND "julgamento_criterios"."criterio_1_id" = 2 AND "julgamento_criterios"."criterio_2_id" = 2 LIMIT ?  [["projeto_id", 1], ["LIMIT", 1]]
INSERT INTO "julgamento_criterios" ("projeto_id", "criterio_1_id", "criterio_2_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["projeto_id", 1], ["criterio_1_id", 1], ["criterio_2_id", 1], ["created_at", "2017-05-22 00:58:28.327409"], ["updated_at", "2017-05-22 00:58:28.327409"]]
---
  def new
    @projeto = Projeto.find(params[:projeto_id])

    @criterios1 = @projeto.criterios.all
    @criterios2 = @projeto.criterios.all

    @criterios1.each do |c1|
      @criterios2.each do |c2|

          if JulgamentoCriterio.find_by(:projeto_id => @projeto.id, :criterio_1 => c1.id, :criterio_2 => c2.id) == nil
            @julgamento_criterio = JulgamentoCriterio.new
            @julgamento_criterio.projeto_id = @projeto.id
            @julgamento_criterio.criterio_1_id = c1.id
            @julgamento_criterio.criterio_2_id = c2.id
            @julgamento_criterio.save

SELECT  "criterios".* FROM "criterios" WHERE "criterios"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "julgamento_criterios".* FROM "julgamento_criterios" WHERE "julgamento_criterios"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_julgamento_criterio
      @julgamento_criterio = JulgamentoCriterio.find(params[:id])

UPDATE "criterios" SET "prioridade" = ?, "updated_at" = ? WHERE "criterios"."id" = ?  [["prioridade", 0.0], ["updated_at", 2016-12-02 01:00:06 UTC], ["id", 8]]
UPDATE "julgamento_criterios" SET "valor" = ?, "updated_at" = ? WHERE "julgamento_criterios"."id" = ?  [["valor", 1.0], ["updated_at", 2016-11-29 19:13:01 UTC], ["id", 5]]
---
    def update_all
      JulgamentoCriterio.update(params[:jc].keys, params[:jc].values)