app/controllers/julgamentos_controller.rb

  def index
    @julgamentos = Julgamento.all
---
SELECT "julgamentos".* FROM "julgamentos"

  def new
    @projeto = Projeto.find(params[:projeto_id])

    @criterios = @projeto.criterios.all
    @alternativas1 = @projeto.alternativas.all
    @alternativas2 = @projeto.alternativas.all

    @criterios.each do |criterio|
      @alternativas1.each do |alternativa_1|

        @alternativas2.each do |alternativa_2|

          if Julgamento.find_by(:projeto_id => @projeto.id, :usuario_id => current_usuario.id, :criterio => criterio.id, :alternativa_1 => alternativa_1, :alternativa_2 => alternativa_2) == nil
            @julgamento = Julgamento.new
            @julgamento.projeto_id = @projeto.id
            @julgamento.usuario_id = current_usuario.id
            @julgamento.criterio_id = criterio.id
            @julgamento.alternativa_1_id = alternativa_1.id
            @julgamento.alternativa_2_id = alternativa_2.id
            @julgamento.save
---
SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "criterios".* FROM "criterios" WHERE "criterios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "alternativas".* FROM "alternativas" WHERE "alternativas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "julgamentos".* FROM "julgamentos" WHERE "julgamentos"."projeto_id" = $1 AND "julgamentos"."alternativa_1_id" = $2 AND "julgamentos"."alternativa_2_id" = $3 AND "julgamentos"."criterio_id" = $4 LIMIT $5  [["projeto_id", 1], ["alternativa_1_id", 1], ["alternativa_2_id", 1], ["criterio_id", 1], ["LIMIT", 1]]
INSERT INTO "julgamentos" ("usuario_id", "projeto_id", "criterio_id", "alternativa_1_id", "alternativa_2_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["usuario_id", 1], ["projeto_id", 1], ["criterio_id", 2], ["alternativa_1_id", 1], ["alternativa_2_id", 1], ["created_at", 2016-11-24 18:10:58 UTC], ["updated_at", 2016-11-24 18:10:58 UTC]]

  def update_all
    Julgamento.update(params[:j].keys, params[:j].values)
---
UPDATE "julgamentos" SET "valor" = ?, "updated_at" = ? WHERE "julgamentos"."id" = ?  [["valor", 1.0], ["updated_at", 2016-11-27 23:14:34 UTC], ["id", 20]]

    def set_julgamento
      @julgamento = Julgamento.find(params[:id])
---
SELECT  "julgamentos".* FROM "julgamentos" WHERE "julgamentos"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]