app/controllers/projetos_controller.rb

  def index
    @projetos = Projeto.all
---
SELECT "projetos".* FROM "projetos"

  def create
    @projeto = Projeto.new(projeto_params)

    respond_to do |format|
      if @projeto.save
---
INSERT INTO "projetos" ("nome", "descricao", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "projeto de teste1"], ["descricao", ""], ["created_at", "2018-06-11 12:29:02.311002"], ["updated_at", "2018-06-11 12:29:02.311002"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @projeto.update(projeto_params)
---
UPDATE "projetos" SET "nome" = ?, "updated_at" = ? WHERE "projetos"."id" = ?  [["nome", "projeto de teste1"], ["updated_at", "2018-05-11 17:45:25.920622"], ["id", 1]]

  def destroy
    @projeto.destroy
---
DELETE FROM "projetos" WHERE "projetos"."id" = ?  [["id", 2]]

  def resultado
    @projeto = Projeto.find(params[:projeto_id])
    @alternativas = @projeto.alternativas.all
    @criterios = @projeto.criterios.all
    @alternativas.each do |a|
      prioridade = 0
      @criterios.each do |c|
        @pr = PrioridadeRelativa.find_by(:alternativa => a.id, :criterio => c.id)
        prioridade = prioridade+(@pr.valor*c.prioridade)
      end
      a.update(:prioridade_global => prioridade)
---
SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "alternativas".* FROM "alternativas" WHERE "alternativas"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT  "criterios".* FROM "criterios" WHERE "criterios"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "prioridade_relativas".* FROM "prioridade_relativas" WHERE "prioridade_relativas"."alternativa_id" = 8 AND "prioridade_relativas"."criterio_id" = 13 LIMIT ?  [["LIMIT", 1]]
UPDATE "alternativas" SET "prioridade_global" = ?, "updated_at" = ? WHERE "alternativas"."id" = ?  [["prioridade_global", 0.30940698902428715], ["updated_at", 2016-12-11 21:54:49 UTC], ["id", 8]]

    def set_projeto
      @projeto = Projeto.find(params[:id])
---
SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]