app/views/alternativas/show.html.erb

<%= link_to 'Editar', edit_alternativa_path(@alternativa, projeto_id: @alternativa.projeto_id), :class => "btn btn-warning" %>
<%= link_to 'Voltar', Projeto.find(@alternativa.projeto_id), :class => "btn btn-primary" %>
---
SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]