app/views/julgamento_criterios/_form.html.erb

SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <%= submit_tag "Salvar", :class => "btn btn-primary"%>
  <%= link_to "Voltar",Projeto.find(params[:projeto_id]) ,:class => "btn btn-warning"%>