app/views/julgamentos/_form.html.erb


  <% @julgamentos = Julgamento.find(:all, :usuario_id => current_usuario.id) %>

  <% Criterio.all.each do |c|  %>
---
SELECT  "julgamentos".* FROM "julgamentos" WHERE "julgamentos"."usuario_id" = ? LIMIT ?  [["usuario_id", 1], ["LIMIT", 1]]
SELECT "criterios".* FROM "criterios"

    <table>
      <% Alternativa.all.each do |a|%>
---
SELECT "alternativas".* FROM "alternativas"