app/views/julgamentos/_form.html.erb

SELECT "criterios".* FROM "criterios" WHERE "criterios"."projeto_id" = ?  [["projeto_id", 1]]
---

  <% @projeto.criterios.each do |c| %>

SELECT  "projetos".* FROM "projetos" WHERE "projetos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <%= submit_tag "Salvar", :class => "btn btn-primary"%>
  <%= link_to "Voltar",Projeto.find(params[:projeto_id]) ,:class => "btn btn-warning"%>